Autodesk.Revit.DB.IExportContext.OnFaceBegin(Autodesk.Revit.DB.FaceNode)
This method marks the beginning of a Face to be exported
Remarks:
Note that this method (as well as OnFaceEnd) is invoked only if the custom
exporter was set up to include geometric objects in the output stream.
See Autodesk::Revit::DB::CustomExporter::IncludeGeometricObjects for mode details.
node:
An output node that represents a Face.
Returns:
Return RenderNodeAction. Proceed if you wish to receive geometry (polymesh)
for this face, or return RenderNodeAction.Skip otherwise.
Since:
2014

Autodesk.Revit.DB.IExportContext
An interface that is used in custom export to process a Revit model.
Remarks:
An instance of a class that implements this interface is passed in as a
parameter of the Autodesk::Revit::DB::CustomExporter constructor.
The methods of the context are then called at times of exporting entities of the model.
This is a base class for two other interfaces derived from it:
Autodesk::Revit::DB::IPhotoRenderContext and
Autodesk::Revit::DB::IModelExportContext which are both
new since Revit 2016. This base class contains methods that are common
to both the leaf interfaces. Although it is still possible to use classes
deriving directly from this base interface (for backward compatibility),
future applications should implement the new leaf interfaces only.
Since:
2014